<?php

$translations = [
    /* ترجمة الفهرس */
    'index_title' => 'إدارة الـلجان التربوية | جامعة 8 مايو 1945 قالمة',
    'index_header' => 'إدارة اللجان التربوية',
    'username' => 'اسم المستخدم',
    'password' => 'كلمة المرور',
    'login' => 'تسجيل الدخول',
    'fpass' => 'هل نسيت كلمة المرور؟',
    'change_pass' => 'تغيير كلمة المرور',
    'current_pass' => 'كلمة المرور الحالية',
    'informations' => 'المعلومات',
    'info_text' => 'يسمح النظام من جهة بإدارة ومراقبة الأعضاء الذين يقومون بتنفيذ العديد من الأعمال التربوية، وضبط تواريخ الاجتماعات، وإرسال الدعوات، إلخ. ومن جهة أخرى، يسمح للممثلين (رؤساء التخصصات والمدرسين والطلاب) بمتابعة العمليات التربوية داخل القسم، وتحديداً: متابعة تقدم الدورات، وإتمام الفصول، وبرمجة المراقبات المستمرة، إلخ.',
    'copy_text' => 'جميع الحقوق محفوظة © 2023 جامعة 8 مايو 1945، قسم علوم الحاسوب',
    'dev_team' => 'فريق التطوير <strong> تحت إشراف ',
    'khaled' => 'الدكتور خالد حليمي',
    'idris' => 'إدريس شعلال',
    'hamed' => 'حامد خبيزي',


    /* DASHBOARD */
    'title' => 'المدير',
    'home' => 'الرئيسية',
    'menu' => 'القائمة',

    /* SIDEBAR */
    'manage_users' => 'إدارة المستخدمين',
    'add_user' => 'إضافة مستخدم',
    'managers' => 'مدراء المساقات',
    'delegates' => 'المندوبون',
    'teachers' => 'الأساتذة',
    'admin' => 'المدير',
    'superadmin' => 'المدير العام',

    /* TEACHERS */
    'manage_teachers' => 'إدارة الأساتذة',
    'teachers_table' => 'جدول بيانات الأساتذة',
    'manage_promos' => 'إدارة التخصصات',
    'add_promotion' => 'إضافة تخصص',
    'manage_modules' => 'إدارة الوحدات الدراسية',
    'view_cp' => 'عرض جميع اللجان البيداغوجية',
    'consult_all_cp' => 'عرض جميع بيانات اللجان البيداغوجية',
    'consult_modules_data' => 'عرض بيانات الوحدات الدراسية',
    'manage_pass' => 'إدارة كلمات المرور',
    'messages' => 'الرسائل',





    'sort_table' => 'انقر على رؤوس الجداول للترتيب',
    'search' => 'بحث',
    'sbun' => 'البحث بواسطة اسم المستخدم',
    'msg_info2' => 'اكتب كلمة <strong>رسالة</strong> في شريط البحث لرؤية الرسائل غير المقروءة.',
    'all_users_pass' => 'إدارة كلمات مرور جميع المستخدمين',
    /* CRUD */
    'edit' => 'تعديل',
    'delete' => 'حذف',

    /* RESPONSABLES */
    'managers_table' => 'جدول بيانات مسؤولي التخصصات التدريبية',
    'add_manager' => 'إضافة مدير دورة تدريبية',

    /* DELEGATES */
    'add_delegate' => 'إضافة مندوب',
    'delegate_of' => 'مندوب/ة لدى',


    /* TEACHER */
    'teacher_of' => 'مدرس لـ ',

    /* PROMOTION */
    'promotion_tables' => 'جدول بيانات التخصصات',
    'promotion_name' => 'اسم التخصص',
    'promotion_manager' => 'مدير التخصص',
    'select_prom_resp' => 'تحديد مدير التخصص',
    'select_promotion' => 'تحديد التخصص',
    'promotion' => 'التخصص',
    'semester' => 'الفصل الدراسي',
    'semester_nb' => 'الفصل الدراسي رقم: ',
    'action' => 'الإجراء.',
    'by' => 'بواسطة',

    'delete_promo' => 'هل أنت متأكد أنك تريد حذف هذه التخصص؟',


    'not_required' => 'غير مطلوب',
    'edit_user' => 'تعديل المستخدم',
    'edit_form_pls' => 'يرجى تعديل النموذج أدناه.',
    'fill_form_pls' => 'يرجى ملء النموذج أدناه.',

    /* MODULES */
    'add_module' => 'إضافة وحدة',
    'module_name' => 'اسم الوحدة',
    'module' => 'وحدة',
    'select_mod_prom' => 'حدد تخصص الوحدة',
    'select_mod_teach' => 'حدد معلم الوحدة',
    'mdl_list' => 'قائمة المواد الدراسية لمستواي',

    'view_mdl' => 'عرض الوحدات الدراسية',
    

    'abbr' => 'الاختصار',
    'advancment' => 'حالة التقدم',

    'global_adv' => 'نسبة التقدم في الدروس',
    'nb_chap_done_progress'=>'عدد الدروس الإجمالي / قيد التنفيذ',
    'n_s_c_done'=>'عدد حصص الدروس النظرية المنجزة',
    'n_s_td_tp_done'=>'عدد حصص (الأعمال التطبيقية والأعمال الموجهة) التي تم انجازها',
    'n_s_ctdtp_not_done' => 'عدد حصص (الأعمال التطبيقية والأعمال الموجهة والدروس النظرية) التي لم يتم انجازها',
    'p_m'=>'العروض التقديمية + الاختبارات',
    'presentation_test'=>'العروض + الاختبارات',
    'tp_validation'=>'تقييم الأعمال التطبيقية',
    'handout_course'=>'الدروس والدروس النظرية المقدمة',
    'avis_ens'=>'رأي المدرّس',



    /* DASHBOARD */
    'teachers' => 'المعلمين',
    'managers' => 'مديرو التخصصات',
    'delegates' => 'المندوبين',

    /* LOGOUT */
    'logout' => 'تسجيل الخروج',
    'logout_message' => 'هل أنت متأكد أنك تريد تسجيل الخروج؟',
    'cancel' =>'إلغاء',
    'yes' =>'نعم',

    'previous' =>'سابق',
    'next' =>'التالي',
    'add' =>'إضافة',



    /* MODAL ADD USER */
    'add_user_text' =>'يرجى ملء هذا النموذج لإنشاء حساب.',
    'full_name' =>'الاسم الكامل (الاسم اللقب)',
    'email' =>'البريد الإلكتروني',
    'department' => 'القسم',
    'please_select' => 'الرجاء التحديد',
    'select_user_type' => 'الرجاء تحديد نوع المستخدم.',
    'confirm_password'=> 'تأكيد كلمة المرور',
    'fill_the_field' =>'يرجى ملء هذا الحقل.',



    /* MANAGER SPACE */
    'add_cp' => 'جدولة CP',
    'manage_cps' => 'إدارة CPs',
    'cp_title' => 'عنوان CP',
    'cp_datetime' => 'تاريخ ووقت CP',
    'cp_location' => 'مكان CP',
    'cp_agenda' => 'جدول أعمال CP',
    'cp_details' => 'تفاصيل CP',
    'generate_report' => 'إنشاء تقرير',
    'consult' => 'الاطلاع',
    'consult_delegates' => 'استشارة نموذج المندوبين',
    'cp_list' => 'قائمة اجتماعات اللجان البيداغوجيه',

    /* CP */
    'status' =>'الحالة',
    'desactivated' =>'معطل',
    'activated' =>'مفعل',
    'desactivate' =>'تعطيل',
    'activate' =>'تفعيل',
    'back' =>'العودة',
    'printr' =>'طباعة التقرير',
    'extra_info' =>'معلومات إضافية',
    'cp_delete' =>'هل أنت متأكد من أنك تريد حذف هذا CP؟',
    'cp_desactivated' => 'غير مفعل',
    'cp_desactivated_msg' => 'تم الغاء تفعيل اجتماع اللجان البيداغوجيه يرجى مراسله  مسير التخصصات البيداغوجيه',

    'delete_module' => 'هل أنت متأكد أنك تريد حذف هذه الوحدة؟',
    'btn_desplay_mdl_data' => 'عرض وتعديل بيانات الوحدة الدراسية',
    'completed' => 'مكتمل',
    'not_completed' => 'غير مكتمل',
    'please_fill_the_fields' => 'يرجى ملء الحقول بالمعلومات المناسبة',

    'no_data' => 'لا تتوفر بيانات',
    'add_learning_data' => 'إضافة بيانات التقدم في الدروس ',
    'no_cp_found' => 'لم تتم جدولة اجتماع اللجنة حاليا!',

];

?>
